#include <stdio.h>
#include <stdlib.h>

/* Напишите программу, выводящую ваше имя и адрес. */

int main()
{
    printf("Name: Pavel Parfirev\n");
    printf("Adress: p.parfirev@yandex.ru\n");

    return 0;
}
