#include <stdio.h>
#include <stdlib.h>

/* Ќапишите программу, котора€ использует первый вызов функции printf() дл€
вывода своего имени и фамилии в одной строке, второй вызов printf(), чтобы
вывести им€ и фамилию в двух строках, и еще два вызова printf() дл€ вывода
имени и фамилии в одной строке. ¬ыходные данные должны иметь следующий
вид (но с указанием ваших персональных данных) */

int main()
{
    printf("Pavel Parfirev\n");
    printf("Pavel\nParfirev\n");
    printf("Pavel ");
    printf("Parfirev\n");
    return 0;
}
