#include <stdio.h>
#include <stdlib.h>
/* Напишите программу, которая выдает предупредительный звуковой сигнал, а затем
выводит текст */

int main()
{
    printf("\a \"Oh shi...\"\n");
    return 0;
}
